//
//  Lists.swift
//  TravelSchedule
//
//  Created by Ди Di on 07/09/25.
//

let cities = ["Москва", "Санкт Петербург", "Сочи", "Горный воздух", "Краснодар", "Казань", "Омск"]

let stations: [String: [String]] = [
    "Москва":
        ["Киевский вокзал", "Курский вокзал", "Ярославский вокзал", "Белорусский вокзал", "Савеловский вокзал", "Ленинградский вокзал"],
    "Санкт Петербург": [
        "Балтийский вокзал",
        "Невский вокзал",
        "Красногвардейский вокзал",
        "Ленинский вокзал",
        "Сенная вокзал",
        "Коллонский вокзал"
    ],
    "Сочи": [
        "Сочи",
        "Адлер",
        "Хоста",
        "Лоо"
    ],
    "Горный воздух": [
        "Южно-Сахалинск"
    ],
    "Краснодар": [
        "Краснодар-1",
        "Краснодар-2",
        "Пашковская"
    ],
    "Казань": [
        "Казань-Пассажирская",
        "Казань-2 (Восстание)",
        "Казань-Пригородная"
    ],
    "Омск": [
        "Омск-Пассажирский",
        "Омск-Северный"
    ]
]
